Reports/МаршрутЛеченияПациента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>МаршрутЛеченияПациента</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/омг_ВедениеМаршрутаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>омг_ВедениеМаршрутаЛечения</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПозицийМаршрута</xr:Item>
				<xr:Item>InformationRegister.КорректировкиПланаЛечения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартЛечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыЛечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Позиции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНазначения</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЭтапыМаршрутаПациента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполненияПозицииМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКорректировокПланаЛечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНазначения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дозировка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриемовВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийСтатус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/МаршрутЛеченияПациента/Forms/ФормаОтчета_85/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборДатаПо = НачалоДня(ТекущаяДатаСеанса());
	ОтборДатаС = ДобавитьМесяц(ОтборДатаПо, -3);
	ТолькоНезавершенные = Истина;
	
	Если Параметры.Свойство("ОтборПациент") И ЗначениеЗаполнено(Параметры.ОтборПациент) Тогда
		ОтборПациент = Параметры.ОтборПациент;
	КонецЕсли;
	Если Параметры.Свойство("ОтборВрач") И ЗначениеЗаполнено(Параметры.ОтборВрач) Тогда
		ОтборВрач = Параметры.ОтборВрач;
	КонецЕсли;
	
	ЗаполнитьМаршрутыНаСервере();
	
	// Прямой вход в конкретный маршрут (из карты пациента двойным кликом — приходит позже).
	Если Параметры.Свойство("ПервичныйПрием") И ЗначениеЗаполнено(Параметры.ПервичныйПрием)
			И Параметры.Свойство("СтандартЛечения") И ЗначениеЗаполнено(Параметры.СтандартЛечения) Тогда
		ПервичныйПрием = Параметры.ПервичныйПрием;
		СтандартТекущегоМаршрута = Параметры.СтандартЛечения;
		ПостроитьМаршрутНаСервере();
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМаршрут;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбзор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьМаршрутыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМаршрутыНаСервере()
	
	Отбор = Новый Структура;
	Отбор.Вставить("Пациент", ОтборПациент);
	Отбор.Вставить("СтандартЛечения", ОтборСтандарт);
	Отбор.Вставить("Филиал", ОтборФилиал);
	Отбор.Вставить("Организация", ОтборОрганизация);
	Отбор.Вставить("Врач", ОтборВрач);
	Отбор.Вставить("ДатаС", ОтборДатаС);
	Отбор.Вставить("ДатаПо", ?(ЗначениеЗаполнено(ОтборДатаПо), КонецДня(ОтборДатаПо), Неопределено));
	Отбор.Вставить("ТолькоНезавершенные", ТолькоНезавершенные);
	
	Маршруты.Загрузить(МаршрутыПациентовСервер.СписокМаршрутов(Отбор));
	
КонецПроцедуры

&НаКлиенте
Процедура МаршрутыВыбор(Элемент, Строка, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Маршруты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПервичныйПрием = ТекущиеДанные.ПервичныйПрием;
	СтандартТекущегоМаршрута = ТекущиеДанные.СтандартЛечения;
	ПостроитьМаршрутНаСервере();
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМаршрут;
	
КонецПроцедуры

&НаКлиенте
Процедура НазадКОбзору(Команда)
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОбзор;
КонецПроцедуры

&НаСервере
Процедура ПостроитьМаршрутНаСервере()
	
	АвтоСтатусыСервер.ПересчитатьАвтоСтатусыМаршрута(ПервичныйПрием, СтандартТекущегоМаршрута);
	Данные = МаршрутыПациентовСервер.ДанныеМаршрута(ПервичныйПрием, СтандартТекущегоМаршрута);
	ОтчетHTML = Отчеты.МаршрутЛеченияПациента.ПостроитьHTML(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ВестиМаршрут(Команда)
	Если Не ЗначениеЗаполнено(ПервичныйПрием)
		ИЛИ Не ЗначениеЗаполнено(СтандартТекущегоМаршрута) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ПервичныйПрием", ПервичныйПрием);
	ЗначенияЗаполнения.Вставить("СтандартЛечения", СтандартТекущегоМаршрута);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.омг_ВедениеМаршрутаЛечения.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОтчет(Команда)
	Закрыть();
КонецПроцедуры
